7zip
a52dec
aalib
abseil-cpp
accounts-qml-module
accountsservice
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
adwaita-icon-theme-legacy
afpfs-ng
aha
alsa-card-profiles
alsa-lib
alsa-plugins
alsa-topology-conf
alsa-ucm-conf
alsa-utils
antlr4
antlr4-runtime
aom
apache
appstream
appstream-glib
appstream-qt
appstream-qt5
apr
apr-util
archlinux-appstream-data
archlinux-keyring
argon2
aribb24
ark
arp-scan
asdf-vm
asdf-vm-debug
assimp
at-spi2-core
atkmm
attica
attica5
attr
audit
autoconf
automake
autopep8
avahi
ayatana-ido
babl
baloo
baloo-widgets
base
base-devel
bash
bat
bc
bcg729
bear
binutils
bison
blas
bluedevil
bluez
bluez-libs
bluez-qt
bluez-utils
bochs
bochs-debug
bolt
boost-libs
brave-bin
breeze
breeze-gtk
breeze-icons
breeze5
brltty
brotli
bsd-games
btrfs-progs
bubblewrap
budgie-backgrounds
budgie-control-center
budgie-desktop
budgie-desktop-view
budgie-screensaver
budgie-session
burpsuite
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cameractrls
cantarell-fonts
cblas
cdparanoia
chromium
cifs-utils
clang
clinfo
cloc
clucene
clutter
clutter-gst
clutter-gtk
cmake
cogl
colord
colord-gtk
colord-gtk-common
compiler-rt
composer
confuse
containerd
convertlit
coordgen
coreutils
cppdap
cracklib
cryptsetup
curl
dav1d
db5.3
dbus
dbus-broker
dbus-broker-units
dbus-glib
dconf
ddcutil
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
discount
discover
dmidecode
dnsmasq
docbook-xml
docbook-xsl
docker
docker-compose
dolphin
dosfstools
dotconf
double-conversion
doxygen
drawing
drkonqi
duktape
e2fsprogs
ebook-tools
editorconfig-core-c
efibootmgr
efivar
egl-wayland
eglexternalplatform
eigen
electron31
electron33
electron34
electrum
ell
enchant
exiv2
expat
extra-cmake-modules
faad2
fakeroot
fcitx5
ffmpeg
ffmpeg4.4
fftw
file
filesystem
filezilla
findutils
firefox
flac
flex
fmt
fontconfig
fontforge
frameworkintegration
frameworkintegration5
freeglut
freerdp2
freetype2
fribidi
fuse-common
fuse2
fuse3
gawk
gc
gcc
gcc-fortran
gcc-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
gdmap
gdu
gegl
geoclue
geocode-glib-2
geocode-glib-common
gettext
ghostscript
giflib
gimp
git
glew
glfw
glib-networking
glib2
glibc
glibmm
glm
glslang
glu
gmp
gnome-bluetooth
gnome-desktop
gnome-desktop-4
gnome-desktop-common
gnome-settings-daemon
gnome-themes-extra
gnu-free-fonts
gnu-netcat
gnuchess
gnulib-l10n
gnupg
gnutls
go
gobject-introspection-runtime
gobuster
gobuster-debug
google-chrome
gperftools
gpgme
gpm
graphene
graphite
graphviz
grep
groff
grpc
grub
grub-customizer
gsettings-desktop-schemas
gsettings-system-schemas
gsfonts
gsm
gsound
gssdp
gst-plugin-pipewire
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gst-plugins-good
gstreamer
gtest
gtk-layer-shell
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm3
gts
guile
gumbo-parser
gupnp
gupnp-igd
gzip
harfbuzz
harfbuzz-icu
hicolor-icon-theme
hidapi
highway
hostapd
htop
http-parser
hunspell
hwdata
hwloc
hydra
hyphen
i2c-tools
iana-etc
ibus
icu
iio-sensor-proxy
ijs
imath
imlib2
inetutils
inotify-tools
intel-gmmlib
intel-media-driver
intel-ucode
iperf
iperf3
iproute2
iptables
iputils
iso-codes
iw
iwd
jansson
jasper
java-environment-common
java-runtime-common
jbig2dec
jbigkit
jdk-openjdk
jdk17-openjdk
jemalloc
john
json-c
json-glib
jsoncpp
kaccounts-integration
kactivitymanagerd
karchive
karchive5
kate
kauth
kauth5
kbd
kbookmarks
kbookmarks5
kcmutils
kcodecs
kcodecs5
kcolorscheme
kcompletion
kcompletion5
kconfig
kconfig5
kconfigwidgets
kconfigwidgets5
kcoreaddons
kcoreaddons5
kcrash
kcrash5
kdbusaddons
kdbusaddons5
kde-cli-tools
kde-gtk-config
kdeclarative
kdeclarative5
kdecoration
kded
kded5
kdeplasma-addons
kdesu
kdnssd
kdoctools5
kdsoap-qt6
kdsoap-ws-discovery-client
keyutils
kfilemetadata
kgamma
kglobalaccel
kglobalaccel5
kglobalacceld
kguiaddons
kguiaddons5
kholidays
ki18n
ki18n5
kiconthemes
kiconthemes5
kidletime
kinfocenter
kio
kio-extras
kio-fuse
kio5
kirigami
kirigami-addons
kirigami2
kitemmodels
kitemviews
kitemviews5
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kjobwidgets5
kmenuedit
kmod
knewstuff
knewstuff5
knotifications
knotifications5
knotifyconfig
konsave
konsole
kpackage
kpackage5
kparts
kpipewire
kpty
kquickcharts
krb5
krdp
krunner
kscreen
kscreenlocker
kservice
kservice5
ksshaskpass
kstatusnotifieritem
ksvg
ksystemstats
ktexteditor
ktextwidgets
ktextwidgets5
kunitconversion
kuserfeedback
kwallet
kwallet-pam
kwallet5
kwayland
kwayland-integration
kwayland5
kwidgetsaddons
kwidgetsaddons5
kwin
kwindowsystem
kwindowsystem5
kwrited
kxmlgui
kxmlgui5
l-smash
lame
lapack
layer-shell-qt
lcms2
ldb
leancrypto
lensfun
leptonica
less
lib32-alsa-lib
lib32-alsa-plugins
lib32-amdvlk
lib32-brotli
lib32-bzip2
lib32-curl
lib32-e2fsprogs
lib32-expat
lib32-gcc-libs
lib32-glibc
lib32-icu
lib32-json-c
lib32-keyutils
lib32-krb5
lib32-libdrm
lib32-libelf
lib32-libffi
lib32-libglvnd
lib32-libgpg-error
lib32-libidn2
lib32-libldap
lib32-libnghttp2
lib32-libnghttp3
lib32-libpciaccess
lib32-libpsl
lib32-libssh2
lib32-libtasn1
lib32-libunistring
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcrypt-compat
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxml2
lib32-libxshmfence
lib32-libxss
lib32-libxxf86vm
lib32-llvm-libs
lib32-lm_sensors
lib32-mesa
lib32-ncurses
lib32-nspr
lib32-nss
lib32-openssl
lib32-p11-kit
lib32-spirv-tools
lib32-sqlite
lib32-vulkan-icd-loader
lib32-wayland
lib32-xz
lib32-zlib
lib32-zstd
libabw
libaccounts-glib
libaccounts-qt
libadwaita
libao
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libatomic_ops
libavc1394
libavif
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libblockdev-crypto
libblockdev-fs
libblockdev-loop
libblockdev-mdraid
libblockdev-nvme
libblockdev-part
libblockdev-swap
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcaca
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdr
libcheese
libcloudproviders
libcmis
libcolord
libcups
libcurl-gnutls
libdaemon
libdatachannel
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libdc1394
libdca
libde265
libdecor
libdeflate
libdisplay-info
libdmtx
libdovi
libdrm
libdv
libdvbpsi
libdvdnav
libdvdread
libe-book
libebml
libebur128
libedit
libei
libelf
libepoxy
libepubgen
libetonyek
libevdev
libevent
libexttextcat
libfabric
libfbclient
libfdk-aac
libffi
libfilezilla
libfontenc
libfreeaptx
libfreehand
libftdi
libgcrypt
libgee
libgexiv2
libgirepository
libgit2
libglvnd
libgnomekbd
libgpg-error
libgtop
libgudev
libgusb
libgweather-4
libhandy
libheif
libibus
libice
libidn
libidn2
libiec61883
libimagequant
libimobiledevice
libimobiledevice-glue
libinih
libinput
libisl
libixion
libjpeg-turbo
libjuice
libjxl
libkexiv2
libksba
libkscreen
libksysguard
liblangtag
liblc3
libldac
libldap
liblouis
libluv
libmad
libmatroska
libmaxminddb
libmbim
libmd
libmemcached-awesome
libmfx
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpcdec
libmpeg2
libmspack
libmspub
libmtp
libmupdf
libmwaw
libmypaint
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnghttp3
libngtcp2
libnice
libnl
libnm
libnma
libnma-common
libnotify
libnsl
libnumbertext
libnvme
libodfgen
libogg
libomxil-bellagio
libopenmpt
liborcus
libp11-kit
libpagemaker
libpaper
libpcap
libpciaccess
libpeas
libpgm
libpipeline
libpipewire
libplacebo
libplasma
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libqaccessibilityclient-qt6
libqalculate
libqmi
libqrtr-glib
libqxp
libraqm
libraw
libraw1394
libreoffice-still
librevenge
librsvg
librsync
libsamplerate
libsasl
libseccomp
libsecp256k1
libsecret
libshout
libsigc++
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspeechd
libspiro
libsrtp
libssh
libssh2
libstaroffice
libstemmer
libsysprof-capture
libtar
libtasn1
libteam
libthai
libtheora
libtiff
libtirpc
libtommath
libtool
libtorrent-rasterbar
libunibreak
libuninameslist
libunistring
libunwind
libupnp
liburing
libusb
libusb-compat
libusbmuxd
libutempter
libutf8proc
libuv
libva
libva-intel-driver
libvdpau
libverto
libvisio
libvlc
libvorbis
libvpl
libvpx
libvterm
libwacom
libwbclient
libwebp
libwireplumber
libwmf
libwnck3
libwpd
libwps
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcrypt-compat
libxcursor
libxcvt
libxdamage
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfce4windowing
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmlb
libxmu
libxpm
libxrandr
libxrender
libxres
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
libzmf
licenses
lightdm
lightdm-gtk-greeter
lilv
linux
linux-api-headers
linux-firmware
linux-firmware-whence
linux-wifi-hotspot
linux-wifi-hotspot-debug
lirc
lksctp-tools
llhttp
llvm-libs
lm_sensors
lmdb
lpsolve
lsb-release
lsof
lua
lua51-lpeg
lua53
luajit
luit
lv2
lz4
lzo
m4
maeparser
magpie-wm
mailcap
make
man-db
man-pages
mariadb
mariadb-clients
mariadb-libs
maven
mbedtls
md4c
mdadm
media-player-info
mesa
mesa-utils
metasploit
milou
minify
minify-debug
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
modemmanager
modemmanager-qt
mongo-c-driver
mpdecimal
mpfr
mpg123
msgpack-c
mtdev
mupdf
mutter
mypaint-brushes1
nano
ncurses
ncurses5-compat-libs
ncurses5-compat-libs-debug
neofetch
neon
neovim
net-tools
netpbm
nettle
network-manager-applet
networkmanager
networkmanager-qt
nftables
ngrok
ninja
nlohmann-json
nm-connection-editor
nmap
node-gyp
nodejs
nodejs-nopt
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
npth
nspr
nss
ntfs-3g
numactl
obs-studio
ocean-sound-theme
ocl-icd
onetbb
oniguruma
openal
openbabel
openbabel2
openbabel2-debug
opencore-amr
opencv
openexr
openjpeg2
openmpi
openpmix
openssh
openssl
openucx
openvpn
openxr
opus
orc
orca
outguess
oxygen
oxygen-sounds
oxygen5
p11-kit
pacman
pacman-contrib
pacman-mirrorlist
pam
pambase
pango
pangomm
parted
patch
pciutils
pcre
pcre2
pcsclite
peerflix
perl
perl-algorithm-diff
perl-class-method-modifiers
perl-clone
perl-data-optlist
perl-devel-globaldestruction
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookiejar
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-import-into
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-module-runtime
perl-moo
perl-net-http
perl-parallel-forkmanager
perl-params-util
perl-regexp-common
perl-role-tiny
perl-sub-exporter
perl-sub-exporter-progressive
perl-sub-install
perl-sub-quote
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
phonon-qt5
phonon-qt5-gstreamer
phonon-qt6
phonon-qt6-vlc
php
php-apache
php-fpm
php-pear
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
plasma-activities
plasma-activities-stats
plasma-browser-integration
plasma-desktop
plasma-disks
plasma-firewall
plasma-integration
plasma-meta
plasma-nm
plasma-pa
plasma-systemmonitor
plasma-thunderbolt
plasma-vault
plasma-welcome
plasma-workspace
plasma-workspace-wallpapers
plasma5-integration
plasma5support
polkit
polkit-kde-agent
polkit-qt5
polkit-qt6
poppler
poppler-data
poppler-glib
poppler-qt6
popt
portaudio
postgresql
postgresql-libs
potrace
power-profiles-daemon
powerdevil
ppp
print-manager
prismlauncher-qt5-bin
prismlauncher-qt5-bin-debug
prison
procps-ng
protobuf
proxychains-ng
prrte
psmisc
pulseaudio-qt
purpose
python
python-aiohappyeyeballs
python-aiohttp
python-aiohttp-socks
python-aiorpcx
python-aiosignal
python-async-timeout
python-attrs
python-autocommand
python-bitarray
python-bitstring
python-build
python-cairo
python-certifi
python-cffi
python-charset-normalizer
python-contourpy
python-cryptography
python-cycler
python-dateutil
python-dnspython
python-ecdsa
python-fastjsonschema
python-filelock
python-fonttools
python-frozenlist
python-gobject
python-gpgme
python-idna
python-inflect
python-installer
python-jaraco.collections
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-jsonpatch
python-jsonpointer
python-jsonrpclib-pelix
python-kiwisolver
python-markdown
python-matplotlib
python-more-itertools
python-multidict
python-mysql-connector
python-numpy
python-ordered-set
python-packaging
python-pbkdf2
python-pillow
python-pip
python-platformdirs
python-protobuf
python-psutil
python-pyaes
python-pyaml
python-pycodestyle
python-pycparser
python-pycryptodomex
python-pygdbmi
python-pyparsing
python-pypng
python-pyproject-hooks
python-pyqt5
python-pyqt5-sip
python-pysocks
python-python-socks
python-pyxdg
python-qrcode
python-requests
python-sentry_sdk
python-setproctitle
python-setuptools
python-setuptools-scm
python-six
python-tomli
python-trove-classifiers
python-typeguard
python-typing_extensions
python-urllib3
python-validate-pyproject
python-websocket-client
python-wheel
python-yaml
python-yarl
python2-bin
qalculate-gtk
qbittorrent
qca-qt5
qca-qt6
qcoro
qhull
qqc2-breeze-style
qqc2-desktop-style
qrencode
qt5-base
qt5-declarative
qt5-graphicaleffects
qt5-imageformats
qt5-multimedia
qt5-quickcontrols
qt5-quickcontrols2
qt5-sensors
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-x11extras
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-multimedia
qt6-multimedia-ffmpeg
qt6-positioning
qt6-quick3d
qt6-quicktimeline
qt6-sensors
qt6-shadertools
qt6-speech
qt6-svg
qt6-tools
qt6-translations
qt6-virtualkeyboard
qt6-wayland
qt6-webchannel
qt6-webengine
qt6-websockets
qt6-webview
qtkeychain-qt6
r
r-gparotation
r-mnormt
r-psych
raptor
rasqal
rav1e
raylib
re2
readline
redland
rhash
ripgrep
ripgrep-all
rnnoise
rtkit
rubberband
ruby
ruby-bundler
ruby-erb
rubygems
runc
rust
sbc
scid_vs_pc
scid_vs_pc-debug
scilab-bin
sddm
sddm-kcm
sdl2-compat
sdl3
sed
semver
sequoia-sqv
serd
serf
sfml
shaderc
shadow
shared-mime-info
signon-kwallet-extension
signon-plugin-oauth2
signon-ui
signond
simdjson
slang
smartmontools
smbclient
snappy
socat
sof-firmware
solid
solid5
sonnet
sonnet5
sord
sound-theme-freedesktop
source-highlight
spandsp
spdlog
spectacle
speech-dispatcher
speex
speexdsp
spirv-tools
spotify-launcher
sqlite
sqlmap
sratom
srt
startup-notification
steam
stockfish
stockfish-debug
subversion
sudo
suitesparse
supertuxkart
svt-av1
swi-prolog
syndication
syndication5
syntax-highlighting
systemd
systemd-libs
systemd-sysvcompat
systemsettings
taglib
talloc
tar
tcl
tdb
tesseract
tesseract-data-afr
tesseract-data-osd
tevent
texinfo
tinysparql
tk
tor
torbrowser-launcher
torrentflix
tpm2-tss
traceroute
trash-cli
tree-sitter
tree-sitter-c
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
tslib
ttf-hack
ttf-liberation
ttf-symbola
twolame
tzdata
udisks2
unibilium
unzip
upower
usbmuxd
usbutils
uthash
util-linux
util-linux-libs
v4l-utils
vapoursynth
verdict
vesktop-bin
vid.stab
vim
vim-runtime
visual-studio-code-bin
visual-studio-code-bin-debug
vlc
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
vulkan-intel
vulkan-radeon
vulkan-tools
wacomtablet
wavpack
wayland
wayland-protocols
wayland-utils
webrtc-audio-processing-1
wget
which
whois
wireless_tools
wireplumber
wireshark-cli
wireshark-qt
woff2
wpa_supplicant
wxwidgets-common
wxwidgets-gtk3
x264
x265
xbitmaps
xboard
xcb-imdkit
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xclip
xdg-desktop-portal
xdg-desktop-portal-gtk
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xf86-input-libinput
xf86-input-wacom
xf86-video-amdgpu
xf86-video-ati
xf86-video-nouveau
xf86-video-vesa
xf86-video-vmware
xfce4-terminal
xfconf
xkeyboard-config
xmlsec
xorg-bdftopcf
xorg-docs
xorg-font-util
xorg-fonts-100dpi
xorg-fonts-75dpi
xorg-fonts-alias-100dpi
xorg-fonts-alias-75dpi
xorg-fonts-alias-misc
xorg-fonts-encodings
xorg-fonts-misc
xorg-iceauth
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-server-devel
xorg-server-xephyr
xorg-server-xnest
xorg-sessreg
xorg-setxkbmap
xorg-smproxy
xorg-util-macros
xorg-x11perf
xorg-xauth
xorg-xbacklight
xorg-xcmsdb
xorg-xcursorgen
xorg-xdpyinfo
xorg-xdriinfo
xorg-xev
xorg-xgamma
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkbcomp
xorg-xkbevd
xorg-xkbutils
xorg-xkill
xorg-xlsatoms
xorg-xlsclients
xorg-xmessage
xorg-xmodmap
xorg-xpr
xorg-xprop
xorg-xrandr
xorg-xrdb
xorg-xrefresh
xorg-xset
xorg-xsetroot
xorg-xvinfo
xorg-xwayland
xorg-xwd
xorg-xwininfo
xorg-xwud
xorgproto
xsettingsd
xterm
xvidcore
xxhash
xz
yay
yay-debug
zenity
zeromq
zimg
zip
zix
zlib
zlib-ng
zram-generator
zsh
zsh-theme-powerlevel10k-git
zstd
zvbi
zxing-cpp
